java-se-example/src/object_oriented_design_and_analysis/chapter_01_well_designed_apps_rock/part2/README.md
```mermaid
classDiagram
    class Instrument {
        <<abstract>>
        -String serialNumber
        -double price
        -InstrumentSpec spec
        +getSerialNumber() String
        +getPrice() double
        +setPrice(float) void
        +getSpec() InstrumentSpec
    }

    class InstrumentSpec {
        <<abstract>>
        -Builder builder
        -String model
        -Type type
        -Wood backWood
        -Wood topWood
        +matches(InstrumentSpec) boolean
    }

    class Guitar {
        +Guitar(String, double, GuitarSpec)
    }

    class GuitarSpec {
        -int numStrings
        +getNumStrings() int
        +matches(InstrumentSpec) boolean
    }

    class Mandolin {
        +Mandolin(String, double, MandolinSpec)
    }

    class MandolinSpec {
        -Style style
        +matches(InstrumentSpec) boolean
    }

    class Inventory {
        -List~Instrument~ inventory
        +addInstrument(String, double, InstrumentSpec) void
        +get(String) Instrument
        +search(MandolinSpec) List~Instrument~
    }

    Instrument <|-- Guitar
    Instrument <|-- Mandolin
    InstrumentSpec <|-- GuitarSpec
    InstrumentSpec <|-- MandolinSpec
    Instrument --> InstrumentSpec
    Inventory --> Instrument
```
